app/views/posts/_unbookmark.html.slim

= link_to bookmark_path(current_user.bookmarks.find_by(post_id: post.id)), id: "js-bookmark-button-for-post-#{post.id}", class:"float-right", method: :delete do
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 22], ["LIMIT", 1]]