app/controllers/comments_controller.rb

  def create
    comment = current_user.comments.build(comment_params)
    if comment.save
---
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "確認"], ["user_id", 1], ["post_id", 12], ["created_at", "2023-03-27 16:08:15.712399"], ["updated_at", "2023-03-27 16:08:15.712399"]]