app/controllers/maps_controller.rb

INSERT INTO "maps" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "立川"], ["latitude", 35.69797], ["longitude", 139.4135537], ["created_at", "2023-04-12 16:58:29.612761"], ["updated_at", "2023-04-12 16:58:29.612761"]]
---
    def create
        map = Map.new(map_params)
        if map.save

SELECT "maps".* FROM "maps" WHERE "maps"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "maps" WHERE "maps"."id" = $1  [["id", 2]]
---
    def destroy
        map = Map.find(params[:id])
        map.destroy