app/controllers/posts_controller.rb

  def index
    @posts = Post.all.includes(:user).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]

  def new
    @post = Post.new

    @maps = Map.all
---
SELECT "maps".* FROM "maps"

  def create
    @maps = Map.all#あとでまとめて読み込ませる
    @map = Map.new
    @post = current_user.posts.build(post_params)
    if @post.save
---
SELECT "maps".* FROM "maps"
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "確認"], ["body", "確認"], ["created_at", "2023-03-29 07:49:35.015673"], ["updated_at", "2023-03-29 07:49:35.015673"]]

  def show
    @post = Post.find(params[:id])
    @comment = Comment.new #コメントの新規作成
    @comments = @post.comments.includes(:user).order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 11]]

  def edit
    @maps = Map.all
---
SELECT "maps".* FROM "maps"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "今日のメニュー"], ["updated_at", "2023-03-29 21:42:50.675450"], ["id", 20]]

  def destroy
    @post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 14]]

  def find_post
    @post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 24], ["LIMIT", 1]]