app/models/user.rb

INSERT INTO "bookmarks" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 22], ["created_at", "2023-04-01 16:31:45.724392"], ["updated_at", "2023-04-01 16:31:45.724392"]]
---
  def bookmark(post)
    bookmark_posts << post

DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 1]]
---
  def unbookmark(post)
    bookmark_posts.destroy(post)